; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=47, remove_proportion=0.2, bases=9, instance_id=29, output=./training, seed=70

(define (problem warehouse-29)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 - base
    )
    (:init
        (to-remove box7)
        (to-remove box8)
        (to-remove box9)
        (to-remove box10)
        (to-remove box19)
        (to-remove box21)
        (to-remove box29)
        (to-remove box30)
        (to-remove box45)
        (clear box19)
        (on box19 box14)
        (on box14 box33)
        (on box33 box30)
        (on-base box30 base1)
        (clear box44)
        (on box44 box22)
        (on box22 box41)
        (on box41 box6)
        (on box6 box13)
        (on box13 box29)
        (on box29 box37)
        (on box37 box24)
        (on box24 box12)
        (on-base box12 base2)
        (clear box35)
        (on box35 box25)
        (on box25 box39)
        (on box39 box18)
        (on box18 box45)
        (on-base box45 base3)
        (clear box4)
        (on box4 box28)
        (on box28 box38)
        (on box38 box1)
        (on-base box1 base4)
        (clear box42)
        (on box42 box34)
        (on box34 box17)
        (on box17 box9)
        (on box9 box20)
        (on-base box20 base5)
        (clear box16)
        (on box16 box8)
        (on box8 box26)
        (on box26 box36)
        (on-base box36 base6)
        (clear box32)
        (on box32 box3)
        (on box3 box43)
        (on box43 box47)
        (on box47 box5)
        (on box5 box10)
        (on box10 box2)
        (on-base box2 base7)
        (clear box11)
        (on box11 box23)
        (on box23 box46)
        (on box46 box15)
        (on box15 box21)
        (on-base box21 base8)
        (clear box40)
        (on box40 box27)
        (on box27 box7)
        (on box7 box31)
        (on-base box31 base9)
    )
    (:goal (and 
        (removed box7)
        (removed box8)
        (removed box9)
        (removed box10)
        (removed box19)
        (removed box21)
        (removed box29)
        (removed box30)
        (removed box45)
    ))
)

; plan
1. (move box11 box23 box4)
   deleted: (clear box4) (on box11 box23)
   added: (on box11 box4) (clear box23)
   goals met: 0 of 9
2. (move box16 box8 box11)
   deleted: (clear box11) (on box16 box8)
   added: (on box16 box11) (clear box8)
   goals met: 0 of 9
3. (move box23 box46 box16)
   deleted: (clear box16) (on box23 box46)
   added: (on box23 box16) (clear box46)
   goals met: 0 of 9
4. (remove box19 box14)
   deleted: (on box19 box14) (clear box19)
   added: (removed box19) (clear box14)
   goals met: 1 of 9
5. (move box14 box33 box23)
   deleted: (clear box23) (on box14 box33)
   added: (on box14 box23) (clear box33)
   goals met: 1 of 9
6. (move box32 box3 box14)
   deleted: (clear box14) (on box32 box3)
   added: (on box32 box14) (clear box3)
   goals met: 1 of 9
7. (move box3 box43 box32)
   deleted: (clear box32) (on box3 box43)
   added: (on box3 box32) (clear box43)
   goals met: 1 of 9
8. (move box33 box30 box3)
   deleted: (clear box3) (on box33 box30)
   added: (on box33 box3) (clear box30)
   goals met: 1 of 9
9. (remove-from-base box30 base1)
   deleted: (on-base box30 base1) (clear box30)
   added: (removed box30) (clear-base base1)
   goals met: 2 of 9
10. (move box35 box25 box33)
   deleted: (clear box33) (on box35 box25)
   added: (on box35 box33) (clear box25)
   goals met: 2 of 9
11. (move box25 box39 box35)
   deleted: (clear box35) (on box25 box39)
   added: (on box25 box35) (clear box39)
   goals met: 2 of 9
12. (move box39 box18 box25)
   deleted: (clear box25) (on box39 box18)
   added: (on box39 box25) (clear box18)
   goals met: 2 of 9
13. (move box18 box45 box39)
   deleted: (clear box39) (on box18 box45)
   added: (on box18 box39) (clear box45)
   goals met: 2 of 9
14. (move box40 box27 box18)
   deleted: (clear box18) (on box40 box27)
   added: (on box40 box18) (clear box27)
   goals met: 2 of 9
15. (move box27 box7 box40)
   deleted: (clear box40) (on box27 box7)
   added: (on box27 box40) (clear box7)
   goals met: 2 of 9
16. (move box42 box34 box27)
   deleted: (clear box27) (on box42 box34)
   added: (on box42 box27) (clear box34)
   goals met: 2 of 9
17. (move box34 box17 box42)
   deleted: (clear box42) (on box34 box17)
   added: (on box34 box42) (clear box17)
   goals met: 2 of 9
18. (move box17 box9 box34)
   deleted: (clear box34) (on box17 box9)
   added: (on box17 box34) (clear box9)
   goals met: 2 of 9
19. (move box43 box47 box17)
   deleted: (clear box17) (on box43 box47)
   added: (on box43 box17) (clear box47)
   goals met: 2 of 9
20. (move box44 box22 box43)
   deleted: (clear box43) (on box44 box22)
   added: (on box44 box43) (clear box22)
   goals met: 2 of 9
21. (move box22 box41 box44)
   deleted: (clear box44) (on box22 box41)
   added: (on box22 box44) (clear box41)
   goals met: 2 of 9
22. (move box41 box6 box22)
   deleted: (clear box22) (on box41 box6)
   added: (on box41 box22) (clear box6)
   goals met: 2 of 9
23. (move box46 box15 box41)
   deleted: (clear box41) (on box46 box15)
   added: (on box46 box41) (clear box15)
   goals met: 2 of 9
24. (remove-from-base box45 base3)
   deleted: (on-base box45 base3) (clear box45)
   added: (removed box45) (clear-base base3)
   goals met: 3 of 9
25. (move box15 box21 box46)
   deleted: (clear box46) (on box15 box21)
   added: (on box15 box46) (clear box21)
   goals met: 3 of 9
26. (move box47 box5 box15)
   deleted: (clear box15) (on box47 box5)
   added: (on box47 box15) (clear box5)
   goals met: 3 of 9
27. (remove-from-base box21 base8)
   deleted: (on-base box21 base8) (clear box21)
   added: (removed box21) (clear-base base8)
   goals met: 4 of 9
28. (move box5 box10 box47)
   deleted: (clear box47) (on box5 box10)
   added: (on box5 box47) (clear box10)
   goals met: 4 of 9
29. (remove box10 box2)
   deleted: (on box10 box2) (clear box10)
   added: (removed box10) (clear box2)
   goals met: 5 of 9
30. (move box6 box13 box2)
   deleted: (clear box2) (on box6 box13)
   added: (on box6 box2) (clear box13)
   goals met: 5 of 9
31. (move box13 box29 box5)
   deleted: (clear box5) (on box13 box29)
   added: (on box13 box5) (clear box29)
   goals met: 5 of 9
32. (remove box29 box37)
   deleted: (on box29 box37) (clear box29)
   added: (removed box29) (clear box37)
   goals met: 6 of 9
33. (remove box7 box31)
   deleted: (on box7 box31) (clear box7)
   added: (removed box7) (clear box31)
   goals met: 7 of 9
34. (remove box8 box26)
   deleted: (on box8 box26) (clear box8)
   added: (removed box8) (clear box26)
   goals met: 8 of 9
35. (remove box9 box20)
   deleted: (on box9 box20) (clear box9)
   added: (removed box9) (clear box20)
   goals met: 9 of 9
